[Killed] BlockStatement
users/application/usecases/login.usecase.ts:14:71
     private readonly tokenProvider: TokenProvider,
   ) {}
 
-  async execute(input: LoginInput): Promise<{ access_token: string }> {
-    let user = await this.userRepository.findByEmail(input.emailOrCpf);
-
-    if (!user) {
-      user = await this.userRepository.findByCpf(input.emailOrCpf);
-    }
-
-    if (!user) {
-      throw new UnauthorizedError('Invalid credentials');
-    }
-
-    const passwordMatch = await this.hashProvider.compare(
-      input.password,
-      user.passwordHash,
-    );
-
-    if (!passwordMatch) {
-      throw new UnauthorizedError('Invalid credentials');
-    }
-
-    const payload = { sub: user.id, email: user.email, name: user.name };
-    const access_token = await this.tokenProvider.generate(payload);
-
-    return { access_token };
-  }
+  async execute(input: LoginInput): Promise<{ access_token: string }> {}
 }
 
killedBy: LoginUseCase should return a token if credentials are valid (email)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"access_token": "jwt-token"}
Received: undefined

[Killed] BlockStatement
users/application/usecases/login.usecase.ts:21:16
       user = await this.userRepository.findByCpf(input.emailOrCpf);
     }
 
-    if (!user) {
-      throw new UnauthorizedError('Invalid credentials');
-    }
+    if (!user) {}
 
     const passwordMatch = await this.hashProvider.compare(
killedBy: LoginUseCase should throw UnauthorizedError if user is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Invalid credentials"
Received message: "Cannot read properties of null (reading 'passwordHash')"

[Killed] BooleanLiteral
users/application/usecases/login.usecase.ts:30:9
       user.passwordHash,
     );
 
-    if (!passwordMatch) {
+    if (passwordMatch) {
       throw new UnauthorizedError('Invalid credentials');
     }
killedBy: LoginUseCase should return a token if credentials are valid (email)
statusReason: UnauthorizedError: Invalid credentials

[Killed] ConditionalExpression
users/application/usecases/login.usecase.ts:30:9
       user.passwordHash,
     );
 
-    if (!passwordMatch) {
+    if (false) {
       throw new UnauthorizedError('Invalid credentials');
     }
killedBy: LoginUseCase should throw UnauthorizedError if password does not match
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"access_token": undefined}

[Killed] StringLiteral
users/application/usecases/login.usecase.ts:31:35
     );
 
     if (!passwordMatch) {
-      throw new UnauthorizedError('Invalid credentials');
+      throw new UnauthorizedError("");
     }
 
killedBy: LoginUseCase should throw UnauthorizedError if password does not match
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Invalid credentials"
Received message: ""

[Killed] ObjectLiteral
users/application/usecases/login.usecase.ts:34:21
       throw new UnauthorizedError('Invalid credentials');
     }
 
-    const payload = { sub: user.id, email: user.email, name: user.name };
+    const payload = {};
     const access_token = await this.tokenProvider.generate(payload);
 
killedBy: LoginUseCase should return a token if credentials are valid (email)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "john@example.com",
-   "name": "John Doe",
