[Killed] BlockStatement
plans/application/usecases/create-plan.usecase.ts:7:41
 
 export class CreatePlanUseCase {
   constructor(private readonly planRepository: PlanRepository) {}
-  async execute(input: CreatePlanInput) {
-    const planExists = await this.planRepository.findByName(input.name);
-    if (planExists) {
-      throw new ConflictError('Plan name already exists');
-    }
-    const newPlan = await this.planRepository.create(input);
-    return newPlan;
-  }
+  async execute(input: CreatePlanInput) {}
 }
 
killedBy: CreatePlanUseCase Should throw an error if plan name already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
plans/application/usecases/create-plan.usecase.ts:9:9
   constructor(private readonly planRepository: PlanRepository) {}
   async execute(input: CreatePlanInput) {
     const planExists = await this.planRepository.findByName(input.name);
-    if (planExists) {
+    if (true) {
       throw new ConflictError('Plan name already exists');
     }
killedBy: CreatePlanUseCase Should create and return a new plan
statusReason: ConflictError: Plan name already exists

[Killed] ConditionalExpression
plans/application/usecases/create-plan.usecase.ts:9:9
   constructor(private readonly planRepository: PlanRepository) {}
   async execute(input: CreatePlanInput) {
     const planExists = await this.planRepository.findByName(input.name);
-    if (planExists) {
+    if (false) {
       throw new ConflictError('Plan name already exists');
     }
killedBy: CreatePlanUseCase Should throw an error if plan name already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Plan name already exists"
Received message: "Method not implemented."
