[Killed] BlockStatement
plans/application/usecases/delete-plan.usecase.ts:8:48
 export class DeletePlanUseCase {
   constructor(private readonly planRepository: PlanRepository) {}
 
-  async execute(planId: string): Promise<void> {
-    const existingPlan = await this.planRepository.findById(planId);
-
-    if (!existingPlan) {
-      throw new NotFoundError(`Plan with id ${planId} not found`);
-    }
-
-    await this.planRepository.delete(planId);
-  }
+  async execute(planId: string): Promise<void> {}
 }
 
killedBy: DeletePlanUseCase should throw NotFoundError if plan does not exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
plans/application/usecases/delete-plan.usecase.ts:11:24
   async execute(planId: string): Promise<void> {
     const existingPlan = await this.planRepository.findById(planId);
 
-    if (!existingPlan) {
-      throw new NotFoundError(`Plan with id ${planId} not found`);
-    }
+    if (!existingPlan) {}
 
     await this.planRepository.delete(planId);
killedBy: DeletePlanUseCase should throw NotFoundError if plan does not exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Plan with id non-existent-id not found"
Received message: "Method not implemented."

[Killed] ConditionalExpression
plans/application/usecases/delete-plan.usecase.ts:11:9
   async execute(planId: string): Promise<void> {
     const existingPlan = await this.planRepository.findById(planId);
 
-    if (!existingPlan) {
+    if (true) {
       throw new NotFoundError(`Plan with id ${planId} not found`);
     }
killedBy: DeletePlanUseCase should delete the plan if it exists
statusReason: NotFoundError: Plan with id 1 not found
