[Killed] BlockStatement
plans/application/usecases/find-plan-by-id.usecase.ts:8:55
 export class FindPlanByIdUseCase {
   constructor(private readonly planRepository: PlanRepository) {}
 
-  async execute(planId: string): Promise<Plan | null> {
-    const existingPlan = await this.planRepository.findById(planId);
-
-    if (!existingPlan) {
-      throw new NotFoundError(`Plan with id ${planId} not found`);
-    }
-
-    return existingPlan;
-  }
+  async execute(planId: string): Promise<Plan | null> {}
 }
 
killedBy: FindPlanByIdUseCase Should throw an not found error when plan not exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
plans/application/usecases/find-plan-by-id.usecase.ts:11:9
   async execute(planId: string): Promise<Plan | null> {
     const existingPlan = await this.planRepository.findById(planId);
 
-    if (!existingPlan) {
+    if (false) {
       throw new NotFoundError(`Plan with id ${planId} not found`);
     }
killedBy: FindPlanByIdUseCase Should throw an not found error when plan not exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] StringLiteral
plans/application/usecases/find-plan-by-id.usecase.ts:12:31
     const existingPlan = await this.planRepository.findById(planId);
 
     if (!existingPlan) {
-      throw new NotFoundError(`Plan with id ${planId} not found`);
+      throw new NotFoundError(``);
     }
 
killedBy: FindPlanByIdUseCase Should throw an not found error when plan not exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Plan with id 1 not found"
Received message: ""
