[Killed] BlockStatement
plans/application/usecases/list-plans.usecase.ts:7:36
 export class ListPlansUseCase {
   constructor(private readonly planRepository: PlanRepository) {}
 
-  async execute(): Promise<Plan[]> {
-    return this.planRepository.findAll();
-  }
+  async execute(): Promise<Plan[]> {}
 }
 
killedBy: ListPlansUseCase Should return a list of avaliable plans
statusReason: TypeError: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined
