[Killed] BlockStatement
plans/application/usecases/update-plan.usecase.ts:10:56
 export class UpdatePlanUseCase {
   constructor(private readonly planRepository: PlanRepository) {}
 
-  async execute(input: UpdatePlanInput): Promise<Plan> {
-    const plan: Plan | null = await this.planRepository.findById(input.id);
-    if (!plan) {
-      throw new NotFoundError('Plan not found');
-    }
-    if (input.name) {
-      const existingPlanWithName: Plan | null =
-        await this.planRepository.findByName(input.name);
-      if (existingPlanWithName && existingPlanWithName.id !== input.id) {
-        throw new ConflictError('Plan name already exists');
-      }
-    }
-    return await this.planRepository.update(input.id, input);
-  }
+  async execute(input: UpdatePlanInput): Promise<Plan> {}
 }
 
killedBy: UpdatePlanUseCase should throw NotFoundError if plan does not exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
plans/application/usecases/update-plan.usecase.ts:12:9
 
   async execute(input: UpdatePlanInput): Promise<Plan> {
     const plan: Plan | null = await this.planRepository.findById(input.id);
-    if (!plan) {
+    if (true) {
       throw new NotFoundError('Plan not found');
     }
killedBy: UpdatePlanUseCase should throw ConflictError if new name already belongs to another plan
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Plan name already exists"
Received message: "Plan not found"

[Killed] BlockStatement
plans/application/usecases/update-plan.usecase.ts:12:16
 
   async execute(input: UpdatePlanInput): Promise<Plan> {
     const plan: Plan | null = await this.planRepository.findById(input.id);
-    if (!plan) {
-      throw new NotFoundError('Plan not found');
-    }
+    if (!plan) {}
     if (input.name) {
       const existingPlanWithName: Plan | null =
killedBy: UpdatePlanUseCase should throw NotFoundError if plan does not exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Plan not found"
Received message: "Method not implemented."

[Killed] ConditionalExpression
plans/application/usecases/update-plan.usecase.ts:15:9
     if (!plan) {
       throw new NotFoundError('Plan not found');
     }
-    if (input.name) {
+    if (true) {
       const existingPlanWithName: Plan | null =
         await this.planRepository.findByName(input.name);
killedBy: UpdatePlanUseCase should update the plan without checking name if name is not provided
statusReason: Error: Method not implemented.

[Killed] ConditionalExpression
plans/application/usecases/update-plan.usecase.ts:15:9
     if (!plan) {
       throw new NotFoundError('Plan not found');
     }
-    if (input.name) {
+    if (false) {
       const existingPlanWithName: Plan | null =
         await this.planRepository.findByName(input.name);
killedBy: UpdatePlanUseCase should throw ConflictError if new name already belongs to another plan
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Plan name already exists"
Received message: "Method not implemented."

[Killed] ConditionalExpression
plans/application/usecases/update-plan.usecase.ts:18:35
     if (input.name) {
       const existingPlanWithName: Plan | null =
         await this.planRepository.findByName(input.name);
-      if (existingPlanWithName && existingPlanWithName.id !== input.id) {
+      if (existingPlanWithName && true) {
         throw new ConflictError('Plan name already exists');
       }
killedBy: UpdatePlanUseCase should not throw ConflictError if the name belongs to the plan being updated
statusReason: ConflictError: Plan name already exists

[Killed] ConditionalExpression
plans/application/usecases/update-plan.usecase.ts:18:11
     if (input.name) {
       const existingPlanWithName: Plan | null =
         await this.planRepository.findByName(input.name);
-      if (existingPlanWithName && existingPlanWithName.id !== input.id) {
+      if (true) {
         throw new ConflictError('Plan name already exists');
       }
killedBy: UpdatePlanUseCase should update and return the plan
statusReason: ConflictError: Plan name already exists
