[Killed] BlockStatement
users/application/usecases/register-user.usecase.ts:12:43
     private readonly hashProvider: HashProvider,
   ) {}
 
-  async execute(input: RegisterUserInput) {
-    const emailExists = await this.userRepository.findByEmail(input.email);
-    if (emailExists) {
-      throw new ConflictError('E-mail already in use');
-    }
-
-    const cpfExists = await this.userRepository.findByCpf(input.cpf);
-    if (cpfExists) {
-      throw new ConflictError('CPF already in use');
-    }
-
-    const hashedPassword = await this.hashProvider.hash(input.password);
-
-    const newUser = await this.userRepository.create({
-      name: input.name,
-      email: input.email,
-      cpf: input.cpf,
-      passwordHash: hashedPassword,
-    });
-
-    return newUser;
-  }
+  async execute(input: RegisterUserInput) {}
 }
 
killedBy: RegisterUserUseCase (unit) should register a new user successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"cpf": "12345678901", "createdAt": 2026-09-14T19:17:28.365Z, "email": "john@example.com", "id": "uuid", "name": "John Doe", "passwordHash": "hashed_password_123", "updatedAt": 2026-09-14T19:17:28.365Z}
Received: undefined

[Killed] ConditionalExpression
users/application/usecases/register-user.usecase.ts:14:9
 
   async execute(input: RegisterUserInput) {
     const emailExists = await this.userRepository.findByEmail(input.email);
-    if (emailExists) {
+    if (true) {
       throw new ConflictError('E-mail already in use');
     }
killedBy: RegisterUserUseCase (unit) should register a new user successfully
statusReason: ConflictError: E-mail already in use

[Killed] ConditionalExpression
users/application/usecases/register-user.usecase.ts:14:9
 
   async execute(input: RegisterUserInput) {
     const emailExists = await this.userRepository.findByEmail(input.email);
-    if (emailExists) {
+    if (false) {
       throw new ConflictError('E-mail already in use');
     }
killedBy: RegisterUserUseCase (unit) should throw ConflictError if email is already in use
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
users/application/usecases/register-user.usecase.ts:15:31
   async execute(input: RegisterUserInput) {
     const emailExists = await this.userRepository.findByEmail(input.email);
     if (emailExists) {
-      throw new ConflictError('E-mail already in use');
+      throw new ConflictError("");
     }
 
killedBy: RegisterUserUseCase (unit) should throw ConflictError if email is already in use
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "E-mail already in use"
Received message: ""

[Killed] ConditionalExpression
users/application/usecases/register-user.usecase.ts:19:9
     }
 
     const cpfExists = await this.userRepository.findByCpf(input.cpf);
-    if (cpfExists) {
+    if (false) {
       throw new ConflictError('CPF already in use');
     }
killedBy: RegisterUserUseCase (unit) should throw ConflictError if cpf is already in use
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
users/application/usecases/register-user.usecase.ts:19:20
     }
 
     const cpfExists = await this.userRepository.findByCpf(input.cpf);
-    if (cpfExists) {
-      throw new ConflictError('CPF already in use');
-    }
+    if (cpfExists) {}
 
     const hashedPassword = await this.hashProvider.hash(input.password);
killedBy: RegisterUserUseCase (unit) should throw ConflictError if cpf is already in use
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
